{
    "name": "Sahil Yogesh Hadke",
    "email": "shadke1@asu.edu",
    "phone": "+1-6026936593",
    "website": "https://sahil.hadke.in/",
    "location": "Tempe, AZ",
    "education": [
        {
            "degree": "Masters Science - Computer Science",
            "university": "Arizona State University",
            "location": "USA",
            "date_of_completion": "December 2025",
            "grade": "4.3/4",
            "coursework": "Semantic Web Mining, Data Visualization, Knowledge Representation Reasoning"
        },
        {
            "degree": "Masters Science - Computer Science",
            "university": "Arizona State University",
            "location": "USA",
            "date_of_completion": "December 2025",
            "grade": "4.3/4",
            "coursework": "Semantic Web Mining, Data Visualization, Knowledge Representation Reasoning"
        }
    ],
    "skill_section": [
        {
            "name": "Programming Languages",
            "skills": "Python, Java, C++, JavaScript"
        },
        {
            "name": "Frameworks/Tools",
            "skills": "Node, Express, React, Web Scraping, Selenium, Unity 3D, AWS"
        }
    ],
    "work_experience": [
        {
            "role": "Software Engineer",
            "company": "FIS",
            "location": "Pune, India",
            "from": "May 2022",
            "to": "December 2023",
            "description": [
                "Saved 1500 hours developing and implementing an automated funding booking system using Selenium Java.",
                "Contributed 750 hours/year savings automating web-based project management processes",
                "Worked in an Agile environment, following Agile principles and practices in project execution."
            ]
        },
        {
            "role": "Full Stack Developer - Internship",
            "company": "OG Advertising Private Limited",
            "location": "Pune, India",
            "from": "December 2020",
            "to": "June 2022",
            "description": [
                "Led an 80% reduction in manual efforts by developing a web application that automated invoice generation.",
                "Collaborated with prestigious educational institutes in India, delivering custom website solutions that met unique demands.",
                "Worked on AWS EC2 Instances, utilizing Web Host Manager and cPanel for website hosting"
            ]
        },
        {
            "role": "Studio Associate - Part Time",
            "company": "Next Lab, ASU",
            "location": "Tempe, AZ",
            "from": "April 2024",
            "to": "Present",
            "description": [
                "Collaborating closely with Unity 3D and C# developers to integrate system functionalities seamlessly into game development projects",
                "Worked on AWS EC2 Instances, utilizing Web Host Manager and cPanel for website hosting",
                "Ensuring optimal performance and compatibility with project requirements"
            ]
        }
    ],
    "projects": [
        {
            "name": "JobTailor - Personalized Resume and Cover Letter Solution",
            "techstack": "Python, LLM APIs, Web Scraping, Text Mining",
            "description": [
                "Developed an automated system using Python, LLM APIs, web scraping, and text mining to streamline the customization of resumes and cover letters.",
                "Implemented a feature that analyzes job descriptions using text mining techniques to provide metrics on similarity and tailors the resume to job requirements.",
                "Ensured the project's end-to-end functionality, including web scraping job listings, parsing input documents, and generating final tailored resumes and cover letters in PDF format."
            ]
        },
        {
            "name": "RAG Application",
            "techstack": "Python, LLM APIs, Web Scraping, Text Mining",
            "description": [
                "Developed a Retrieval-Augmented Generation (RAG) application:",
                "Leveraged LangChain to create a web-based RAG model, enhancing text generation with relevant retrieved content.",
                "Implemented a recursive web crawler to gather and preprocess data from multiple web pages for comprehensive data coverage."
            ]
        },
        {
            "name": "Customer Relationship Management Tool",
            "techstack": "CodeIgniter, PHP, MySQL, Bootstrap",
            "description": [
                "Developed a custom CRM tool using CodeIgniter, PHP, MySQL, and Bootstrap, which was utilized by multiple educational institutes in Pune to manage leads and admission campaigns, resulting in a 70% reduction in manual efforts.",
                "Implemented lead aggregation from various sources, including websites, Facebook, and Google, into a centralized dashboard accessible to faculty members for efficient lead management.",
                "Enhanced administrative oversight by providing insights into lead closure rates per faculty, improving strategic decision-making and campaign effectiveness."
            ]
        }
    ]
}